1907. Count Salary Categories

Table: Accounts

+-------------+------+
| Column Name | Type |
+-------------+------+
| account_id  | int  |
| income      | int  |
+-------------+------+
account_id is the primary key (column with unique values) for this table.
Each row contains information about the monthly income for one bank account.
 

Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

"Low Salary": All the salaries strictly less than $20000.
"Average Salary": All the salaries in the inclusive range [$20000, $50000].
"High Salary": All the salaries strictly greater than $50000.
The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Accounts table:
+------------+--------+
| account_id | income |
+------------+--------+
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |
+------------+--------+
Output: 
+----------------+----------------+
| category       | accounts_count |
+----------------+----------------+
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |
+----------------+----------------+
Explanation: 
Low Salary: Account 2.
Average Salary: No accounts.
High Salary: Accounts 3, 6, and 8.

In [17]:
import pandas as pd

data = {"account_id":[3,2,8,6],"income":[108939,12747,87709,91976]}

accounts = pd.DataFrame(data)

accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91976

First determine catoegory for every row.

https://www.codecademy.com/resources/docs/pandas/dataframe/loc

We use .loc property of dataframe to create a new column based on conditions applied to an existing column

In [25]:
accounts.loc[accounts["income"]<20000, "category"] = "Low Salary"
accounts.loc[(accounts["income"]>=20000) & (accounts["income"]<=50000), "category"] = "Average Salary"
accounts.loc[accounts["income"]>50000, "category"] = "High Salary"

accounts

   account_id  income     category
0           3  108939  High Salary
1           2   12747   Low Salary
2           8   87709  High Salary
3           6   91976  High Salary

Now we calculate the number of account_id falling in each of the category range

In [26]:
output = accounts.groupby("category")["account_id"].count()

output

category
High Salary    3
Low Salary     1
Name: account_id, dtype: int64

The data is not formatted properly so we use reset_index() so that dataframe is displayed properly

In [27]:
output = output.reset_index()

output

      category  account_id
0  High Salary           3
1   Low Salary           1

Rename columns in output dataframe

In [28]:
output.columns = ["category", "accounts_count"]

output

      category  accounts_count
0  High Salary               3
1   Low Salary               1

Now we need all 3 values of category in table irrespective of whether or not any employee falls in that category, so let create an exhaustive list of all categories

In [29]:
required_categories = ["Low Salary", "Average Salary", "High Salary"]

We add any missing catogory in output and corresponding count as 0

In [30]:
if output.shape[0]<len(required_categories):
    for cat in required_categories:
        if cat not in output["category"].values:
                output = output._append([pd.DataFrame({"category": [cat], "accounts_count": [0]})], ignore_index=True)

output

         category  accounts_count
0     High Salary               3
1      Low Salary               1
2  Average Salary               0

Corresponding Oracle SQL code:

/* Write your PL/SQL query statement below */
with cte as 
(select account_id,
case when income<20000 then 'Low Salary'
when income between 20000 and 50000 then 'Average Salary'
when income>50000 then 'High Salary' end as category
from Accounts),
cte1 as
(select category, count(account_id) as cnt
from cte
group by category)
select  temp.category as "category",
case when temp.category = 'Low Salary' then coalesce(cte1.cnt,0)
when temp.category = 'Average Salary' then coalesce(cte1.cnt,0)
when temp.category = 'High Salary' then coalesce(cte1.cnt,0) end as "accounts_count"
from ( SELECT 'High Salary' AS category FROM DUAL UNION ALL
    SELECT 'Low Salary' AS category FROM DUAL UNION ALL
    SELECT 'Average Salary' AS category FROM DUAL) temp
left join cte1
on temp.category = cte1.category